### 📖 Terraform Plan (infra/resources/dev) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_api_management_subscription.key_with_tracing will be updated in-place
  ~ resource "azurerm_api_management_subscription" "key_with_tracing" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/subscriptions/29b6b37d-86df-422e-ad68-28d7f99c984a"
        # (10 unchanged attributes hidden)
    }

  # module.function_v3_function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "100"
          - "AzureWebJobsStorage__queueServiceUri"                                                             = "https://dxditnplaygroundv3stfn01.queue.core.windows.net/"
          - "COSMOSDB_DATABASE_NAME"                                                                           = "db"
          - "COSMOSDB_ENDPOINT"                                                                                = "https://dx-d-itn-playground-pg-cosno-01.documents.azure.com:443/"
          - "COSMOSDB_TASKS_CONTAINER_NAME"                                                                    = "tasks"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "2"
          - "NODE_OPTIONS"                                                                                     = "--import @pagopa/azure-tracing"
          - "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/tasks"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/api/tasks"
        } -> (known after apply)
        id                                             = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-v3-func-01"
        name                                           = "dx-d-itn-playground-v3-func-01"
        tags                                           = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.2.0"
            "Scope"          = "DX Playground"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (33 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_v3_function_app.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "100"
          - "AzureFunctionsWebHost__hostid"                                                                    = "staging"
          - "AzureWebJobsStorage__queueServiceUri"                                                             = "https://dxditnplaygroundv3stfn01.queue.core.windows.net/"
          - "COSMOSDB_DATABASE_NAME"                                                                           = "db"
          - "COSMOSDB_ENDPOINT"                                                                                = "https://dx-d-itn-playground-pg-cosno-01.documents.azure.com:443/"
          - "COSMOSDB_TASKS_CONTAINER_NAME"                                                                    = "tasks"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "2"
          - "NODE_OPTIONS"                                                                                     = "--import @pagopa/azure-tracing"
          - "SLOT_TASK_HUBNAME"                                                                                = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/tasks"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/api/tasks"
        } -> (known after apply)
        id                                             = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-v3-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.2.0"
            "Scope"          = "DX Playground"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_v3_function_app.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygroundv3stfn01"
        name                               = "dxditnplaygroundv3stfn01"
      ~ public_network_access_enabled      = true -> false
        tags                               = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.2.0"
            "Scope"          = "DX Playground"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_v3_function_app.azurerm_storage_account_network_rules.st_network_rules will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "st_network_rules" {
      ~ default_action             = "Allow" -> "Deny"
        id                         = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.Storage/storageAccounts/dxditnplaygroundv3stfn01"
        # (4 unchanged attributes hidden)
    }

  # module.function_v3_storage.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[dxditnplaygroundv3st01] Low Availability"
      + resource_group_name      = "dx-d-itn-playground-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.function_v3_storage.azurerm_security_center_storage_defender.this[0] will be created
  + resource "azurerm_security_center_storage_defender" "this" {
      + id                                          = (known after apply)
      + malware_scanning_on_upload_cap_gb_per_month = -1
      + malware_scanning_on_upload_enabled          = false
      + override_subscription_settings_enabled      = false
      + sensitive_data_discovery_enabled            = false
      + storage_account_id                          = (known after apply)
    }

  # module.function_v3_storage.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "dxditnplaygroundv3st01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "dx-d-itn-playground-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.function_v3_storage.azurerm_storage_queue.this["tasks-queue"] will be created
  + resource "azurerm_storage_queue" "this" {
      + id                   = (known after apply)
      + metadata             = {
          + "businessunit"   = "devex"
          + "costcenter"     = "ts000 - tecnologia e servizi"
          + "createdby"      = "terraform"
          + "environment"    = "dev"
          + "managementteam" = "developer experience"
          + "modulename"     = "azure_storage_account"
          + "modulesource"   = "dx"
          + "moduleversion"  = "2.1.3"
          + "scope"          = "dx playground"
          + "source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + name                 = "tasks-queue"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "dxditnplaygroundv3st01"
      + url                  = (known after apply)
    }

  # module.storage.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[dxditnplaygroundpgst01] Low Availability"
      + resource_group_name      = "dx-d-itn-playground-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.storage.azurerm_private_endpoint.this["blob"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-playground-pg-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-playground-rg-01"
      + subnet_id                = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-playground-pg-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage.azurerm_private_endpoint.this["queue"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-playground-pg-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-playground-rg-01"
      + subnet_id                = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-playground-pg-queue-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.storage.azurerm_private_endpoint.this["table"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-playground-pg-table-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-playground-rg-01"
      + subnet_id                = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/virtualNetworks/dx-d-itn-common-vnet-01/subnets/dx-d-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-playground-pg-table-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.storage.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "dxditnplaygroundpgst01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "dx-d-itn-playground-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.1.3"
          + "Scope"          = "DX Playground"
          + "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.to_do_api.azurerm_api_management_api.api will be updated in-place
  ~ resource "azurerm_api_management_api" "api" {
        id                    = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api;rev=1"
        name                  = "to-do-api"
        # (17 unchanged attributes hidden)

      ~ import {
          ~ content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
              -   version: 0.0.0
              +   version: 0.0.1
                
                security:
                  - ApiKeyAuth: []
                
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                  /tasks:
                    post:
                      operationId: createTask
                      summary: Create a new task
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/CreateTaskItem'
                      responses:
                        '201':
                          description: Returns the created task
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItem'
                        '400':
                          description: Invalid request body
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                    get:
                      operationId: listTasks
                      summary: List tasks
                      responses:
                        '200':
                          description: Returns a list of tasks.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItemList'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                
                  /tasks/{taskId}:
                    get:
                      description: Get information of a task
                      summary: Get a task
                      operationId: getTaskById
                      parameters:
                        - in: path
                          name: taskId
                          schema:
                            type: string
                          required: true
                          description: The id of the task
                      responses:
                        '200':
                          description: Details of the task
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItem'
                        '404':
                          description: Task not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                    delete:
                      description: Delete a task
                      summary: Delete a task
                      operationId: deleteTask
                      parameters:
                        - in: path
                          name: taskId
                          schema:
                            type: string
                          required: true
                          description: The id of the task
                      responses:
                        '204':
                          description: Task deleted
                        '404':
                          description: Task not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
                    CreateTaskItem:
                      type: object
                      required:
                        - title
                      properties:
                        title:
                          $ref: '#/components/schemas/TaskTitle'
                    TaskId:
                      description: The id of the task
                      type: string
                    TaskTitle:
                      description: The title of the task
                      type: string
                    TaskState:
                      type: string
                      description: |-
                        - COMPLETED: The task has been completed
                        - INCOMPLETE: The task is not yet completed
                        - DELETED: The task has been marked as deleted
                      x-extensible-enum:
                        - COMPLETED
                        - INCOMPLETE
                        - DELETED
                    TaskItem:
                      type: object
                      required:
                        - id
                        - title
                        - state
                      properties:
                        id:
                          $ref: '#/components/schemas/TaskId'
                        title:
                          $ref: '#/components/schemas/TaskTitle'
                        state:
                          $ref: '#/components/schemas/TaskState'
                    TaskItemList:
                      type: array
                      items:
                        $ref: '#/components/schemas/TaskItem'
                    ProblemJSON:
                      type: object
                      required:
                        - status
                        - message
                      properties:
                        status:
                          type: number
                          description: The HTTP status code
                        message:
                          type: string
                          description: The description of the error
            EOT
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.to_do_api_auth_with_identity.azurerm_api_management_api.api will be updated in-place
  ~ resource "azurerm_api_management_api" "api" {
        id                    = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api-auth-identity;rev=1"
        name                  = "to-do-api-auth-identity"
        # (17 unchanged attributes hidden)

      ~ import {
          ~ content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
              -   version: 0.0.0
              +   version: 0.0.1
                
                security:
                  - ApiKeyAuth: []
                
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                  /tasks:
                    post:
                      operationId: createTask
                      summary: Create a new task
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/CreateTaskItem'
                      responses:
                        '201':
                          description: Returns the created task
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItem'
                        '400':
                          description: Invalid request body
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                    get:
                      operationId: listTasks
                      summary: List tasks
                      responses:
                        '200':
                          description: Returns a list of tasks.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItemList'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                
                  /tasks/{taskId}:
                    get:
                      description: Get information of a task
                      summary: Get a task
                      operationId: getTaskById
                      parameters:
                        - in: path
                          name: taskId
                          schema:
                            type: string
                          required: true
                          description: The id of the task
                      responses:
                        '200':
                          description: Details of the task
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItem'
                        '404':
                          description: Task not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                    delete:
                      description: Delete a task
                      summary: Delete a task
                      operationId: deleteTask
                      parameters:
                        - in: path
                          name: taskId
                          schema:
                            type: string
                          required: true
                          description: The id of the task
                      responses:
                        '204':
                          description: Task deleted
                        '404':
                          description: Task not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
                    CreateTaskItem:
                      type: object
                      required:
                        - title
                      properties:
                        title:
                          $ref: '#/components/schemas/TaskTitle'
                    TaskId:
                      description: The id of the task
                      type: string
                    TaskTitle:
                      description: The title of the task
                      type: string
                    TaskState:
                      type: string
                      description: |-
                        - COMPLETED: The task has been completed
                        - INCOMPLETE: The task is not yet completed
                        - DELETED: The task has been marked as deleted
                      x-extensible-enum:
                        - COMPLETED
                        - INCOMPLETE
                        - DELETED
                    TaskItem:
                      type: object
                      required:
                        - id
                        - title
                        - state
                      properties:
                        id:
                          $ref: '#/components/schemas/TaskId'
                        title:
                          $ref: '#/components/schemas/TaskTitle'
                        state:
                          $ref: '#/components/schemas/TaskState'
                    TaskItemList:
                      type: array
                      items:
                        $ref: '#/components/schemas/TaskItem'
                    ProblemJSON:
                      type: object
                      required:
                        - status
                        - message
                      properties:
                        status:
                          type: number
                          description: The HTTP status code
                        message:
                          type: string
                          description: The description of the error
            EOT
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.todo_api_function_app_managed_identity_auth.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "WEBSITE_AUTH_AAD_ALLOWED_TENANTS"                                                                 = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
            # (16 unchanged elements hidden)
        }
        id                                             = "/subscriptions/35e6e3b2-4388-470e-a1b9-ad3bc34326d1/resourceGroups/dx-d-itn-playground-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-id-func-01"
        name                                           = "dx-d-itn-playground-id-func-01"
        tags                                           = {
            "BusinessUnit"   = "DevEx"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Dev"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.2.0"
            "Scope"          = "DX Playground"
            "Source"         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (33 unchanged attributes hidden)

      - auth_settings_v2 {
          - auth_enabled                            = true -> null
          - excluded_paths                          = [] -> null
          - forward_proxy_convention                = "NoProxy" -> null
          - http_route_api_prefix                   = "/.auth" -> null
          - require_authentication                  = true -> null
          - require_https                           = true -> null
          - runtime_version                         = "~1" -> null
          - unauthenticated_action                  = "Return401" -> null
            # (4 unchanged attributes hidden)

          - active_directory_v2 {
              - allowed_applications                 = [
                  - "9750c605-e7ed-4548-bef7-f4ce54443618",
                ] -> null
              - allowed_audiences                    = [] -> null
              - allowed_groups                       = [] -> null
              - allowed_identities                   = [] -> null
              - client_id                            = "8be7b28b-d984-480f-bf6b-5894dbd0906c" -> null
              - jwt_allowed_client_applications      = [] -> null
              - jwt_allowed_groups                   = [] -> null
              - login_parameters                     = {} -> null
              - www_authentication_disabled          = false -> null
                # (3 unchanged attributes hidden)
            }

          - apple_v2 {
              - login_scopes               = [] -> null
                # (2 unchanged attributes hidden)
            }

          - facebook_v2 {
              - login_scopes            = [] -> null
                # (3 unchanged attributes hidden)
            }

          - github_v2 {
              - login_scopes               = [] -> null
                # (2 unchanged attributes hidden)
            }

          - google_v2 {
              - allowed_audiences          = [] -> null
              - login_scopes               = [] -> null
                # (2 unchanged attributes hidden)
            }

          - login {
              - allowed_external_redirect_urls    = [] -> null
              - cookie_expiration_convention      = "FixedTime" -> null
              - cookie_expiration_time            = "08:00:00" -> null
              - nonce_expiration_time             = "00:05:00" -> null
              - preserve_url_fragments_for_logins = false -> null
              - token_refresh_extension_time      = 72 -> null
              - token_store_enabled               = false -> null
              - validate_nonce                    = true -> null
                # (3 unchanged attributes hidden)
            }

          - microsoft_v2 {
              - allowed_audiences          = [] -> null
              - login_scopes               = [] -> null
                # (2 unchanged attributes hidden)
            }

          - twitter_v2 {
                # (2 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 9 to add, 8 to change, 0 to destroy.

Changes to Outputs:
  - function_v3_storage_account_name = "dxplaygroundfuncv3" -> null

Warning: Deprecated attribute

  on .terraform/modules/function_v3_storage/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 3 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.function_v3_storage.azurerm_storage_queue.this["tasks-queue"],
  on .terraform/modules/function_v3_storage/storage_account.tf line 157, in resource "azurerm_storage_queue" "this":
 157:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.
```

</details>
